cases/cfdemElectrochemicalFoam/30volPerc/CFD/constant/polyMesh/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.6                                   |
|   \\  /    A nd           | Web:      http://www.OpenFOAM.org               |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 0.001;

/*vertices
(
    (0 -8 -0.05)
    (1 -8 -0.05)
    (1 4 -0.05)
    (0 4 -0.05)
    (0 -8 0.05)
    (1 -8 0.05)
    (1 4 0.05)
    (0 4 0.05)
);*/

vertices
(
    /*(-0.51 -0.01 -0.06)
    (0.51 -0.01 -0.06)
    (0.51 3.01 -0.06)
    (-0.51 3.01 -0.06)

    (-0.51 -0.01 0.06)
    (0.51 -0.01 0.06)
    (0.51 3.01 0.06)
    (-0.51 3.01 0.06)*/

    (-1.0 0 -1.0)
    (1.0 0 -1.0)
    (1.0 3.0 -1.0)
    (-1.0 3.0 -1.0)

    (-1.0 0 1.0)
    (1.0 0 1.0)
    (1.0 3.0 1.0)
    (-1.0 3.0 1.0)

);

blocks          
(
    hex (0 1 2 3 4 5 6 7) (10 15 10) simpleGrading (1 1 1)
    //hex (0 1 2 3 4 5 6 7) (120 480 1) simpleGrading (1 1 1)
);

edges           
(
);

boundary
(
    inlet
    {
        type cyclic;
    	neighbourPatch outlet;
        faces
        (
            (1 5 4 0)
        );
    }
    outlet
    {
        type cyclic;
	    neighbourPatch inlet;
        faces
        (
            (3 7 6 2)
        );
    }
    wall 
    {
        type wall;
        faces
        (
            (4 5 6 7)
            (0 3 2 1)
        );
    }
    currentCollector
    {
        type patch;
        faces
        (
            (0 4 7 3)
        );
    }
    separator
    {
        type patch;
        faces
        (
            (2 6 5 1)
        );
    }
);

/*mergePatchPairs 
(
);*/

// ************************************************************************* //
