cases/cfdemElectrochemicalFoam/30volPerc/CFD/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.3.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

5
(
    inlet
    {
        type            cyclic;
        inGroups        1(cyclic);
        nFaces          100;
        startFace       4100;
        matchTolerance  0.0001;
        transform       unknown;
        neighbourPatch  outlet;
    }
    outlet
    {
        type            cyclic;
        inGroups        1(cyclic);
        nFaces          100;
        startFace       4200;
        matchTolerance  0.0001;
        transform       unknown;
        neighbourPatch  inlet;
    }
    wall
    {
        type            wall;
        inGroups        1(wall);
        nFaces          300;
        startFace       4300;
    }
    currentCollector
    {
        type            patch;
        nFaces          150;
        startFace       4600;
    }
    separator
    {
        type            patch;
        nFaces          150;
        startFace       4750;
    }
)

// ************************************************************************* //
