cases/cfdemElectrochemicalFoam/30volPerc/CFD/0.org/p
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.2.1                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    inlet
    {
        type 		    cyclic;
    	neighbourPatch 	outlet;
    }
    outlet
    {
        type 		    cyclic;
    	neighbourPatch 	inlet;
    }
    
    currentCollector
    {
        type            zeroGradient;
    }

    separator
    {
        type            zeroGradient;
    }    
 
    wall 
    {
        type            zeroGradient;
    }
}


// ************************************************************************* //
