cases/cfdemElectrochemicalFoam/30volPerc/CFD/0.org/N_OH-
/*---------------------------------------------------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.2-devel                             |
|   \\  /    A nd           | Web:      http://www.openfoam.org               |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    location    "0";
    object 	N_OH-;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 -2 -1 0 1 0 0];

internalField   uniform (0.0 0.0 0.0);

boundaryField
{
    inlet
    {
        type 		    cyclic;
    	neighbourPatch 	outlet;
    }
    outlet
    {
        type 		    cyclic;
    	neighbourPatch 	inlet;
    }
    
    currentCollector
    {
        type            fixedValue;
        value           uniform (0.0 0.0 0.0);
    }

    separator 
    {
        type            zeroGradient;
    }

    wall 
    {
        type            fixedValue;
        value           uniform (0.0 0.0 0.0);
    }
}

// ************************************************************************* //
