cases/cfdemElectrochemicalFoam/30volPerc/CFD/0.org/m
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.6                                   |
|   \\  /    A nd           | Web:      http://www.OpenFOAM.org               |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      m;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -1 0 0 0 0];

internalField   uniform 0.00215;

boundaryField
{
    inlet
    {
        type 		    cyclic;
    	neighbourPatch 	outlet;
    }
    outlet
    {
        type 		    cyclic;
    	neighbourPatch 	inlet;
    }
    
    currentCollector
    {
        type            zeroGradient;
    }

    separator
    {
        type            zeroGradient;
    }    
 
    wall 
    {
        type            zeroGradient;
    }
}

// ************************************************************************* //
