cases/cfdemElectrochemicalFoam/30volPerc/CFD/0.org/percolation
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.3.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      percolation;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 0 0 0 0];

internalField   nonuniform List<scalar> 
1500
(
7.296e-01
5.690e-01
4.970e-01
4.592e-01
3.805e-01
3.568e-01
3.429e-01
3.277e-01
...
)
;

boundaryField
{
    inlet
    {
        type            cyclic;
    }
    outlet
    {
        type            cyclic;
    }
    wall
    {
        type            zeroGradient;
    }
    currentCollector
    {
        type            zeroGradient;
    }
    separator
    {
        type            zeroGradient;
    }
}


// ************************************************************************* //
