cases/cfdemElectrochemicalFoam/30volPerc/CFD/0.org/phiEl
/*---------------------------------------------------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.2-devel                             |
|   \\  /    A nd           | Web:      http://www.openfoam.org               |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object 	phiEl;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 2 -3 0 0 -1 0];

internalField   uniform 0;

boundaryField
{
    inlet
    {
        type 		    cyclic;
    	neighbourPatch 	outlet;
    }
    outlet
    {
        type 		    cyclic;
    	neighbourPatch 	inlet;
    }
    
    currentCollector
    {
        type            calculatedGradient;
        value           uniform 0;
    }

    separator
    {
        type            fixedValue;
        value           uniform 0;
    }    
 
    wall 
    {
        type            zeroGradient;
    }
}
// ************************************************************************* //
